# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [13]:
np.random.randint(1, high=5, size = 100)

array([2, 3, 1, 2, 1, 1, 3, 3, 2, 4, 4, 1, 3, 4, 1, 3, 3, 1, 4, 2, 1, 2,
       2, 2, 3, 1, 1, 4, 4, 4, 3, 1, 3, 2, 3, 3, 3, 2, 3, 4, 1, 2, 2, 3,
       1, 3, 2, 3, 1, 3, 4, 2, 3, 2, 2, 2, 4, 4, 1, 4, 4, 3, 2, 4, 1, 1,
       4, 4, 2, 3, 3, 3, 1, 3, 4, 4, 4, 4, 1, 3, 3, 1, 3, 3, 3, 1, 2, 2,
       4, 2, 1, 1, 4, 2, 3, 1, 4, 4, 1, 1])

In [14]:
no_1 = pd.Series(np.random.randint(1, high=5, size = 100, dtype='l'))
no_2 = pd.Series(np.random.randint(1, high=4, size = 100, dtype='l'))
no_3 = pd.Series(np.random.randint(10000, high=30001, size = 100, dtype='l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

- concat은 2개 이상, 3개 이상도 concat 가능

In [20]:
joinning_series = pd.concat([no_1, no_2, no_3], axis = 1)
joinning_series.head()

   0  1      2
0  2  1  11774
1  4  2  14480
2  2  2  25941
3  1  3  18047
4  1  1  26582

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [23]:
joinning_series.rename(columns = {0 : 'bedrs' , 1 : 'bathrs', 2 : 'price_sqr_meter'}, inplace=True)
joinning_series.head()

   bedrs  bathrs  price_sqr_meter
0      2       1            11774
1      4       2            14480
2      2       2            25941
3      1       3            18047
4      1       1            26582

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [24]:
bigcolumn = pd.concat([no_1, no_2, no_3], axis = 0)

### using to_frame when series to frame

In [26]:
bigcolumn = bigcolumn.to_frame()

In [27]:
bigcolumn.head()

   0
0  2
1  4
2  2
3  1
4  1

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [28]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

In [29]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [30]:
bigcolumn.reset_index(drop=True, inplace=True)

In [34]:
bigcolumn.index

RangeIndex(start=0, stop=300, step=1)

In [35]:
bigcolumn

         0
0        2
1        4
2        2
3        1
4        1
5        2
6        4
7        1
8        4
9        2
10       1
11       4
12       3
13       3
14       3
15       3
16       2
17       2
18       2
19       2
20       3
21       2
22       1
23       2
24       1
25       2
26       4
27       4
28       2
29       4
..     ...
270  12093
271  10501
272  28748
273  21970
274  12979
275  25487
276  27098
277  10816
278  14819
279  23137
280  15325
281  17942
282  11282
283  19802
284  29500
285  21248
286  11785
287  27988
288  23929
289  17298
290  13172
291  16684
292  16861
293  17233
294  13114
295  23506
296  14680
297  11676
298  20231
299  22591

[300 rows x 1 columns]